# coding: utf-8

# 例１：リストのすべての要素を表示する
print ("**例１*************************************************")
for word in ["book","orange","man","bird"]:
	print( word )

# 例２；繰り返し対象が複数の行の場合

print ("**例２*************************************************")
for x in [1,3,5,7]:
	print("x=",x)
	print("x^3=",x**3)
	print("x^10=",x**10)
	print("x^70=",x**70)

# 例２；繰り返し対象が複数の行の場合

print ("**例３*************************************************")
for x in range(1,9,2):
	print("x=",x)
	print("x^3=",x**3)
	print("x^10=",x**10)
	print("x^70=",x**70)
	
